[docs] added basic documentation
